app/controllers/refugees_controller.rb

SELECT "refugees".* FROM "refugees"  ORDER BY created_at DESC
SELECT  "refugees".* FROM "refugees"  ORDER BY "refugees"."id" DESC LIMIT 1
---
	def index
		@refugees = Refugee.all.order("created_at DESC")
		@refugee = Refugee.last

UPDATE "refugees" SET "picture_file_name" = ?, "picture_file_size" = ?, "picture_updated_at" = ?, "updated_at" = ? WHERE "refugees"."id" = ?  [["picture_file_name", "new.jpeg"], ["picture_file_size", 55423], ["picture_updated_at", "2015-11-25 15:26:55.407996"], ["updated_at", "2015-11-25 15:26:56.474515"], ["id", 3]]
---
	def update
		if @refugee.update(refugee_params)

DELETE FROM "refugees" WHERE "refugees"."id" = ?  [["id", 6]]
---
	def destroy
		@refugee.destroy

INSERT INTO "refugees" ("name", "age", "eye_color", "name_of_mother", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "otro"], ["age", 12], ["eye_color", "qwer"], ["name_of_mother", "his mother"], ["created_at", "2015-11-25 03:04:37.697044"], ["updated_at", "2015-11-25 03:04:37.697044"]]
---
	def create
		@refugee = Refugee.new(refugee_params)
		if @refugee.save

SELECT  "refugees".* FROM "refugees" WHERE "refugees"."id" = ? LIMIT 1  [["id", 6]]
---
 	def find_refugee
 		@refugee = Refugee.find(params[:id])